Revit 2024 API
WireTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As WireTypeSetIterator
Visual C++
public:
virtual WireTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace